Revit 2027 API
ForgeTypeId.Clear Method
 Sets the typeId to an empty string
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId Clear()
Public Function Clear As ForgeTypeId
public:
ForgeTypeId^ Clear()
member Clear : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace